src/InformationRegisters/ПингиИнформационныхБаз/ПингиИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПингиИнформационныхБаз</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтветственныеЗаПодключенияИБ/ОтветственныеЗаПодключенияИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЗаПодключенияИБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ОтветственныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыИнформационныхБаз/СтатусыИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнформационныхБаз</name>
  <enumValues>
    <name>Рабочая</name>
  </enumValues>
  <enumValues>
    <name>Тестовая</name>
  </enumValues>
  <enumValues>
    <name>Архивная</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/КонтрольДоступностиБазСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДоступностьБазы() Экспорт 
	
	НедоступностьБазыЧас = Константы.НедоступностьБазыЧас.Получить();
	
	Если ЗначениеЗаполнено(НедоступностьБазыЧас) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		              "ВЫБРАТЬ
		              |	ПингиИнформационныхБазСрезПоследних.ИнформационнаяБаза КАК ИнформационнаяБаза,
		              |	ПингиИнформационныхБазСрезПоследних.ИнформационнаяБаза.Наименование КАК ИнформационнаяБазаНаименование,
		              |	РАЗНОСТЬДАТ(ПингиИнформационныхБазСрезПоследних.Период, &ТекущееВремя, СЕКУНДА) < &НедоступностьБазыЧас * 3600 КАК БазаДоступна,
		              |	РАЗНОСТЬДАТ(ПингиИнформационныхБазСрезПоследних.Период, &ТекущееВремя, ЧАС) КАК ВремяНедоступности
		              |ИЗ
		              |	РегистрСведений.ПингиИнформационныхБаз.СрезПоследних(&ТекущееВремя, ИнформационнаяБаза.СтатусИБ = ЗНАЧЕНИЕ(Перечисление.СтатусыИнформационныхБаз.Рабочая)) КАК ПингиИнформационныхБазСрезПоследних";
		
		Запрос.УстановитьПараметр("ТекущееВремя", ТекущаяДата());
		Запрос.УстановитьПараметр("НедоступностьБазыЧас", НедоступностьБазыЧас);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		ТаблицаНедоступныхБаз = Новый ТаблицаЗначений();
		ТаблицаНедоступныхБаз.Колонки.Добавить("ИнформационнаяБаза", Новый ОписаниеТипов("СправочникСсылка.ИнформационныеБазы"));
		ТаблицаНедоступныхБаз.Колонки.Добавить("ВремяНедоступности", Новый ОписаниеТипов("Число"));
		
		Для Каждого база из РезультатЗапроса Цикл

			Если НЕ база.БазаДоступна Тогда
				ТЗСтрока = ТаблицаНедоступныхБаз.Добавить();
				ТЗСтрока.ИнформационнаяБаза = база.ИнформационнаяБаза; 
				ТЗСтрока.ВремяНедоступности = база.ВремяНедоступности;
			КонецЕсли;	
			
		КонецЦикла;
				
		Если ТаблицаНедоступныхБаз.Количество() > 0 Тогда
			ОтправитьУведомленияПолучателям(ТаблицаНедоступныхБаз);
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОтправитьУведомленияПолучателям(НедоступныеБазы)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НедоступныеБазы.ИнформационнаяБаза КАК ИнформационнаяБаза,
	|	НедоступныеБазы.ВремяНедоступности КАК ВремяНедоступности
	|ПОМЕСТИТЬ ВТ_НедоступныеБазы
	|ИЗ
	|	&НедоступныеБазы КАК НедоступныеБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеЛица.Email КАК Email,
	|	ЛокальныйСрез.ИнформационнаяБаза.Наименование КАК ИнформационнаяБазаНаименование,
	|	ЛокальныйСрез.ИнформационнаяБаза КАК ИнформационнаяБаза,
	|	ВТ_НедоступныеБазы.ВремяНедоступности КАК ВремяНедоступности,
	|	ЛокальныйСрез.ИнформационнаяБаза.ШаблонУведомленияПодключение КАК ШаблонСообщения
	|ИЗ
	|	РегистрСведений.ОтветственныеЗаПодключенияИБ.СрезПоследних(
	|			&ДатаРасчета,
	|			ИнформационнаяБаза В
	|				(ВЫБРАТЬ
	|					ВТ_НедоступныеБазы.ИнформационнаяБаза КАК ИнформационнаяБаза
	|				ИЗ
	|					ВТ_НедоступныеБазы КАК ВТ_НедоступныеБазы)) КАК ЛокальныйСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛица КАК ОтветственныеЛица
	|		ПО ЛокальныйСрез.Ответственный = ОтветственныеЛица.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НедоступныеБазы КАК ВТ_НедоступныеБазы
	|		ПО ЛокальныйСрез.ИнформационнаяБаза = ВТ_НедоступныеБазы.ИнформационнаяБаза
	|ГДЕ
	|	НЕ ЛокальныйСрез.Исключить
	|ИТОГИ ПО
	|	Email";
	
	Запрос.УстановитьПараметр("ДатаРасчета", ТекущаяДата());
	
	Запрос.УстановитьПараметр("НедоступныеБазы", НедоступныеБазы);
	
	ВыборкаПолучатели = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для каждого груп из ВыборкаПолучатели.Строки цикл
		
		EmailПолучателя = груп.Email;
		
		Для Каждого база из груп.Строки Цикл
			
			ШаблонСообщения = База.ШаблонСообщения;
			
			Если Не ЗначениеЗаполнено(ШаблонСообщения) Тогда
				Продолжить;
			КонецЕсли;	                                                
			
			ИдентификаторПисьма = Строка(Новый УникальныйИдентификатор);
			ДополнительныеПараметры = Новый Структура("ЗначенияПараметровСКД", Новый Структура("ИнформационныеБазы", база.ИнформационнаяБаза)); 
			ДанныеПисьма = ШаблоныСообщений.СформироватьСообщение(ШаблонСообщения, база.ИнформационнаяБаза, ИдентификаторПисьма, ДополнительныеПараметры);		 

			Письмо = СформироватьПисьмо(ДанныеПисьма, Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, EmailПолучателя);
			
			РаботаСПочтовымиСообщениями.ОтправитьПисьмо(
				Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,
				Письмо); 
		КонецЦикла;	
 
		
	КонецЦикла;	
		
КонецПроцедуры

Функция СформироватьПисьмо(ДанныеПисьма, УчетнаяЗапись, ЭлАдресаПолучателя)
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Кодировка = "utf-8";
	
	Письмо.Получатели.Добавить(ЭлАдресаПолучателя);
	
	Письмо.Важность = ВажностьИнтернетПочтовогоСообщения.Наивысшая;
	
	Письмо.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
	
	Письмо.Тексты.Добавить(ДанныеПисьма.Текст, ТипТекстаПочтовогоСообщения.HTML);
	Для Каждого Текст Из Письмо.Тексты Цикл
		Текст.Кодировка = "utf-8";
	КонецЦикла;
	
	Письмо.Тема = ДанныеПисьма.Тема;
	
	Возврат Письмо;
	
КонецФункции

#КонецОбласти
